def area(r):
    """
    Возвращает площадь круга по заданному радиусу.

    Параметры:
        r (float): радиус круга.

    Возвращает:
        float: площадь круга.

    Пример:
        >>> area(3)
        28.27431
    """
    return 3.14159 * r * r

def perimeter(r):
    """
    Возвращает длину окружности по заданному радиусу.

    Параметры:
        r (float): радиус круга.

    Возвращает:
        float: длина окружности.

    Пример:
        >>> perimeter(3)
        18.849539999999998
    """
    return 2 * 3.14159 * r

