def area(a):
    """
    Возвращает площадь квадрата по заданной стороне.

    Параметры:
        a (float): сторона квадрата.

    Возвращает:
        float: площадь квадрата.

    Пример:
        >>> area(4)
        16
    """
    return a * a


def perimeter(a):
    """
    Возвращает периметр квадрата по заданной стороне.

    Параметры:
        a (float): сторона квадрата.

    Возвращает:
        float: периметр квадрата.

    Пример:
        >>> perimeter(4)
        16
    """
    return 4 * a
